In [44]:
import pandas as pd
import numpy as np
import matplotlib as plt

%matplotlib inline
DATA = r'/Users/meisan/Documents/GitHub/classes/pandas_practice/ElecmartSales.xlsx'
df = pd.read_excel(DATA)
df.head()

,Date,Day,Time,Region,Card Type,Gender,Buy Category,Items Ordered,Total Cost,High Item
0,2016-03-06,Sun,Morning,West,ElecMart,Female,High,4,136.97,79.97
1,2016-03-06,Sun,Morning,West,Other,Female,Medium,1,25.55,25.55
2,2016-03-06,Sun,Afternoon,West,ElecMart,Female,Medium,5,113.95,90.47
3,2016-03-06,Sun,Afternoon,NorthEast,Other,Female,Low,1,6.82,6.82
4,2016-03-06,Sun,Afternoon,West,ElecMart,Male,Medium,4,147.32,83.21

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 10 columns):
Date             400 non-null datetime64[ns]
Day              400 non-null object
Time             400 non-null object
Region           400 non-null object
Card Type        400 non-null object
Gender           400 non-null object
Buy Category     400 non-null object
Items Ordered    400 non-null int64
Total Cost       400 non-null float64
High Item        400 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 31.3+ KB

In [46]:
#1.During which Time of the day do customers spend the most (based on Total Cost)?
dl = df.groupby('Time')['Total Cost'].sum()
dl

Time
Afternoon    24265.60
Evening      18834.30
Morning      18427.31
Name: Total Cost, dtype: float64

In [47]:
#2.Do male customers spend more than females (based on Total Cost)?
dg = df.groupby('Gender')['Total Cost'].mean()
dg

Gender
Female    157.672051
Male      148.385241
Name: Total Cost, dtype: float64

1.	During which Time of the day do customers spend the most (based on Total Cost)?
2.	Do male customers spend more than females (based on Total Cost)?
3.	Which Region brought in the highest revenue (based on Total Cost) for ElecMart?
4.	Is the ElecMart card more popular among female or male customers?
5.	Which Day of the week brought in the highest revenue for ElecMart?
6.	Among ElecMart card-holders, which Region brought in the highest revenue?
7.	Which Region has the greatest number of female customers?
8.	Female customers prefer to place orders at ElecMart in the morning. True or False?
9.	Male customers prefer to place orders in the evening. True or False?
10.	How many of the orders were placed by females in the South region?

In [49]:
#3.	Which Region brought in the highest revenue (based on Total Cost) for ElecMart?
dr =  df.groupby('Region')['Total Cost'].sum()
dr

Region
MidWest       9618.27
NorthEast    19185.84
South        13429.70
West         19293.40
Name: Total Cost, dtype: float64

In [50]:
#4.	Is the ElecMart card more popular among female or male customers?
de = df.groupby(['Gender','Card Type']).sum()
de

                  Items Ordered  Total Cost  High Item
Gender Card Type
Female ElecMart             288    13858.10    9321.67
       Other                539    23037.16   14906.71
Male   ElecMart             139     6680.94    3558.08
       Other                421    17951.01   12390.59

In [51]:
#5.	Which Day of the week brought in the highest revenue for ElecMart?
dl = df.groupby('Day')['Total Cost'].sum()
dl

Day
Fri    10472.51
Mon     9537.97
Sat     9967.21
Sun     8778.37
Thu     6944.21
Tue     6008.17
Wed     9818.77
Name: Total Cost, dtype: float64

In [52]:
#6.	Among ElecMart card-holders, which Region brought in the highest revenue?
dc = df.loc[df['Card Type'] == 'ElecMart']
dv = dc.groupby('Region')['Total Cost'].sum()
dv

Region
MidWest      3212.73
NorthEast    6885.71
South        4304.53
West         6136.07
Name: Total Cost, dtype: float64

In [53]:
#7.	Which Region has the greatest number of female customers?
de = df.groupby(['Region','Gender']).sum()
de

                  Items Ordered  Total Cost  High Item
Region    Gender
MidWest   Female            136     6383.84    4168.20
          Male               71     3234.43    2257.33
NorthEast Female            237    10175.03    6229.55
          Male              209     9010.81    5248.67
South     Female            194     9028.70    6156.75
          Male               86     4401.00    3204.68
West      Female            260    11307.69    7673.88
          Male              194     7985.71    5237.99

In [54]:
#8.	Female customers prefer to place orders at ElecMart in the morning. True or False?
dc = df.loc[df['Gender'] == 'Female']
dv = dc.groupby('Time').sum()
dv

           Items Ordered  Total Cost  High Item
Time
Afternoon            410    18582.81   12105.99
Evening              122     5582.33    3900.29
Morning              295    12730.12    8222.10

In [55]:
#9.	Male customers prefer to place orders in the evening. True or False?\
dc = df.loc[df['Gender'] == 'Male']
dv = dc.groupby('Time').sum()
dv

           Items Ordered  Total Cost  High Item
Time
Afternoon            140     5682.79    3358.82
Evening              292    13251.97    8549.54
Morning              128     5697.19    4040.31

In [57]:
df[df[['Card Type'] == ['ElecMart']]].groupby('Gender)['Card Type'].sum()

SyntaxError: invalid syntax (<ipython-input-57-49a5ad3f10be>, line 1)